const handler = async (m, {conn}) => {
  m.reply(global.bsfem);
};
handler.command = /^(bsfem|buscarvsfem)$/i;
export default handler;
handler.admin = true
handler.group = true
handler.botAdmin = true

global.bsfem = `
🫧 ⋆ ☇ 𝘽𝙐𝙎𝘾𝙊 𝙑𝙎 𝙁𝙀𝙈 ˏ`୭̥ 🦭

    ›› 𝗛𝗼𝗿𝗮 ¦ 𝗠𝗼𝗱↷ 🕰️
  
⌦ 𝐌𝐨𝐝𝐚𝐥𝐢𝐝𝐚𝐝: 
☁❩ 16:00 🇨🇱🇦🇷 ⌇ 14:00 🇵🇪
⌦ 𝐌𝐨𝐝𝐚𝐥𝐢𝐝𝐚𝐝: 
☁❩ 18:00 🇨🇱🇦🇷 ⌇ 16:00 🇵🇪
⌦ 𝐌𝐨𝐝𝐚𝐥𝐢𝐝𝐚𝐝: 
☁❩ 20:00 🇨🇱🇦🇷 ⌇ 18:00 🇵🇪
⌦ 𝐌𝐨𝐝𝐚𝐥𝐢𝐝𝐚𝐝: 
☁❩ 22:00 🇨🇱🇦🇷 ⌇ 20:00 🇵🇪
⌦ 𝐌𝐨𝐝𝐚𝐥𝐢𝐝𝐚𝐝: 
☁❩ 00:00 🇨🇱🇦🇷 ⌇ 22:00 🇵🇪 

⊹ ִֶָ  🌷Mis reglas, No modifico
⊹ ִֶָ  🌷Sin 🏳‍🌈 , Sin 🖥
⊹ ִֶָ  🌷Hablar con IG si o si.
⊹ ִֶָ  🌷Con logo en mano
`;
