const handler = async (m, {conn}) => {
  m.reply(global.cccompras2);
};
handler.command = /^(cc2|tarjetas|cccompras2)$/i;
export default handler;
global.cccompras2 = `

𝙉𝙊𝙏𝘼: 𝙋𝙧𝙪𝙚𝙗𝙖 𝙚𝙣 𝙨𝙞𝙩𝙞𝙤𝙨 𝙘𝙤𝙢𝙤 𝘾𝘼𝙉𝙑𝘼𝙋𝙍𝙊,𝘚𝘗𝘖𝘛𝘐𝘍𝘠, 𝘏𝘈𝘊𝘌𝘙 𝘛𝘐𝘗𝘖 𝘋𝘌 𝘊𝘖𝘔𝘗𝘙𝘈𝘚 𝘌𝘕 𝘚𝘐𝘛𝘐𝘖𝘚 𝘞𝘌𝘉, 𝘙𝘈𝘗𝘗𝘐, 𝙔𝙏 𝙋𝙍𝙀𝙈𝙄𝙐𝙈, 𝘼𝙋𝙋𝙇𝙀 𝙏𝙑, 𝘿𝙐𝙊𝙇𝙄𝙉𝙂𝙊,𝙑𝙄𝙆𝙄𝙍𝘼𝙆𝙐𝙏𝙀𝙉,𝙈𝙐𝘽𝙄,𝙀𝙏𝘾.\n𝘾𝙤𝙣 𝙄𝙋 𝙙𝙚𝙡 𝙥𝙖𝙞́𝙨 𝙙𝙚 𝙡𝙖 𝘾𝘾\n\n𝙏𝘼𝙈𝘽𝙄𝙀𝙉 𝙀𝙉𝙎𝙀𝙉ñ𝙊 𝘼 𝙎𝘼𝘾𝘼𝙍 𝙏𝙐𝙎 𝙋𝙍𝙊𝙋𝙄𝘼𝙎 𝙋𝙇𝘼𝙏𝘼𝙁𝙊𝙍𝙈𝘼𝙎, 𝙌𝙐𝙀 𝙀𝙎𝙋𝙀𝙍𝘼𝙎?\n𝙃𝘼𝘽𝙇𝘼𝙈𝙀: wa.me/56986469687

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅
⚜️ CC -» 6011212554258488|07|2024|063
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑩𝒓𝒂𝒊𝒏𝒕𝒓𝒆𝒆 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: DISCOVER BANK
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: UNITED STATES 🇺🇸 - USD
⚜️ 𝑰𝒏𝒇𝒐: CREDIT - DISCOVER - PERSONAL
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅
⚜️ CC -» 5326780008114004|07|2027|032
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑩𝒓𝒂𝒊𝒏𝒕𝒓𝒆𝒆 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: ALLIANCE BANK MALAYSIA BERHAD
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: MALAYSIA 🇲🇾 - MYR
⚜️ 𝑰𝒏𝒇𝒐: DEBIT - MASTERCARD - STANDARD
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅
⚜️ CC -» 6011212554254990|07|2024|190
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑩𝒓𝒂𝒊𝒏𝒕𝒓𝒆𝒆 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: DISCOVER BANK
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: UNITED STATES 🇺🇸 - USD
⚜️ 𝑰𝒏𝒇𝒐: CREDIT - DISCOVER - PERSONAL
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝒔𝒕𝒂𝒕𝒖𝒔 = 𝒔𝒖𝒄𝒄𝒆𝒆𝒅𝒆𝒅 
⚜️ CC -» 4999980000206159|11|2024|268
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑻á𝒏𝒂𝒕𝒐𝒔 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: STERLING NATIONAL BANK
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: UNITED STATES 🇺🇸 - USD
⚜️ 𝑰𝒏𝒇𝒐: DEBIT - VISA - BUSINESS
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅
⚜️ CC -» 6011212554252598|07|2024|381
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑩𝒓𝒂𝒊𝒏𝒕𝒓𝒆𝒆 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: DISCOVER BANK
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: UNITED STATES 🇺🇸 - USD
⚜️ 𝑰𝒏𝒇𝒐: CREDIT - DISCOVER - PERSONAL
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝒔𝒕𝒂𝒕𝒖𝒔 = 𝒔𝒖𝒄𝒄𝒆𝒆𝒅𝒆𝒅 
⚜️ CC -» 4268070334175876|11|2025|688
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑻á𝒏𝒂𝒕𝒐𝒔 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: BANCOPPEL, S.A. INSTITUCION BANCA MULTIPLE
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: MEXICO 🇲🇽 - MXN
⚜️ 𝑰𝒏𝒇𝒐: CREDIT - VISA - CLASSIC
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅
⚜️ CC -» 5326780009783708|04|2024|270
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑩𝒓𝒂𝒊𝒏𝒕𝒓𝒆𝒆 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: ALLIANCE BANK MALAYSIA BERHAD
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: MALAYSIA 🇲🇾 - MYR
⚜️ 𝑰𝒏𝒇𝒐: DEBIT - MASTERCARD - STANDARD

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅
⚜️ CC -» 5326780008810874|12|2026|681
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑩𝒓𝒂𝒊𝒏𝒕𝒓𝒆𝒆 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: ALLIANCE BANK MALAYSIA BERHAD
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: MALAYSIA 🇲🇾 - MYR
⚜️ 𝑰𝒏𝒇𝒐: DEBIT - MASTERCARD - STANDARD
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅
⚜️ CC -» 5360581092631961|11|2028|219
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑩𝒓𝒂𝒊𝒏𝒕𝒓𝒆𝒆 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: BANCO DE RESERVAS DE LA REPUBLICA DOMINICANA
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: DOMINICAN REPUBLIC 🇩🇴 - DOP
⚜️ 𝑰𝒏𝒇𝒐: DEBIT - MASTERCARD - STANDARD
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝒔𝒕𝒂𝒕𝒖𝒔 = 𝒔𝒖𝒄𝒄𝒆𝒆𝒅𝒆𝒅 
⚜️ CC -» 4715360003461700|03|2027|791
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑻á𝒏𝒂𝒕𝒐𝒔 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: U.S. BANK CANADA
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: CANADA 🇨🇦 - CAD
⚜️ 𝑰𝒏𝒇𝒐: CREDIT - VISA - CORPORATE T&E
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅
⚜️ CC -» 5234653050344517|08|2027|716
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑩𝒓𝒂𝒊𝒏𝒕𝒓𝒆𝒆 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: TORONTO-DOMINION BANK, THE
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: CANADA 🇨🇦 - CAD
⚜️ 𝑰𝒏𝒇𝒐: CREDIT - MASTERCARD - STANDARD
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» Request was processed successfully. 
⚜️ 𝑪𝑽𝑪 -» M - ⚜️ 𝑨𝑽𝑺 -» U
⚜️ CC -» 4049420117941794|12|2026|212
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑯𝒂𝒅𝒆𝒔 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: BANCO MERCANTIL SANTA CRUZ, S.A.
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: BOLIVIA, PLURINATIONAL STATE OF 🇧🇴 - BOB
⚜️ 𝑰𝒏𝒇𝒐: DEBIT - VISA - CLASSIC
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝

𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝒔𝒕𝒂𝒕𝒖𝒔 = 𝒔𝒖𝒄𝒄𝒆𝒆𝒅𝒆𝒅 
⚜️ CC -» 4999050009235854|06|2027|177
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑻á𝒏𝒂𝒕𝒐𝒔 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: FIRSTCARIBBEAN INTERNATIONAL BANK (BAHAMAS), LTD.
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: BAHAMAS 🇧🇸 - BSD
⚜️ 𝑰𝒏𝒇𝒐: CREDIT - VISA - GOLD
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝

⚜️ 𝑺𝒕𝒂𝒕𝒖𝒔 -» 𝑨𝒑𝒑𝒓𝒐𝒗𝒆𝒅 ✅
⚜️ 𝑹𝒆𝒔𝒑𝒐𝒏𝒔𝒆 -» 𝒔𝒕𝒂𝒕𝒖𝒔 = 𝒔𝒖𝒄𝒄𝒆𝒆𝒅𝒆𝒅 
⚜️ CC -» 5571134278639815|06|2025|218
⚜️ 𝑮𝑨𝑻𝑬 -» 𝑻á𝒏𝒂𝒕𝒐𝒔 ♻️
╚━━━━━━「 𝑫𝑬𝑻𝑨𝑰𝑳𝑺 」━━━━━━╝
⚜️ 𝑩𝒂𝒏𝒌: AKBANK T.A.S.
⚜️ 𝑪𝒐𝒖𝒏𝒕𝒓𝒚: TURKEY 🇹🇷 - TRY
⚜️ 𝑰𝒏𝒇𝒐: CREDIT - MASTERCARD - STANDARD
╚━━━━━━「 𝑰𝑵𝑭𝑶 」━━━━━━╝
`;
