const handler = async (m, {conn}) => {
  m.reply(global.Femvivido16);
};
handler.command = /^(Femvivido16|femvivido16)$/i;
export default handler;
handler.admin = true
handler.group = true
handler.botAdmin = true

global.Femvivido16 = ` 
╭─────╼🧸𝙑𝙎 𝙁𝙀𝙈🧸╾─────╮ㅤ
│
│         🧸 𝘿𝙮𝙡𝙖𝙣𝘽𝙤𝙩-𝙈𝘿 🧸
│        ₊˚︶︶︶︶︶︶︶︶˚ ‧₊
│
│      ෆ 𝘔𝘰𝘥𝘰: 𝚅𝙸𝚅𝙸𝙳𝙾
│      ෆ 𝘏𝘰𝘳𝘢𝘳𝘪𐐫:
│    ‧₊⏰ 16 🇵🇪 ⌇ 17 🇧🇴 ⌇ 18 🇦🇷      
│
│ㅤㅤʚ 𝙹𝚄𝙶𝙰𝙳𝙾𝚁𝙰𝚂🧸:
│
│➼🧸• 
│➼🧸• 
│➼🧸• 
│➼🧸•
│   ㅤㅤ
│ㅤㅤʚ 𝚂𝚄𝙿𝙻𝙴𝙽𝚃𝙴𝚂🧸:
│➼🧸•
│➼🧸•
│
│  ⊹ ִֶָ𝙳𝙾𝙽𝙰𝙳𝙾𝚁𝙰 𝙳𝙴 𝚂𝙰𝙻𝙰🧸: 
│ㅤ
│➼🧸•
╰─────────────────────╯
`;