const handler = async (m, {conn}) => {
  m.reply(global.Mascinfinitovs);
};
handler.command = /^(Mascinfinitovs|mascinfinitovs)$/i;
export default handler;
handler.admin = true
handler.group = true
handler.botAdmin = true

global.Mascinfinitovs = ` 
╭────╼🧸𝙑𝙎 𝙈𝘼𝙎𝘾🧸╾─────╮
│
│         🧸 𝘿𝙮𝙡𝙖𝙣𝘽𝙤𝙩-𝙈𝘿 🧸
│        ₊˚︶︶︶︶︶︶︶︶˚ ‧₊
│
│      ෆ 𝘔𝘰𝘥𝘰: 𝙸𝙽𝙵𝙸𝙽𝙸𝚃𝙾
│      ෆ 𝘏𝘰𝘳𝘢𝘳𝘪𐐫:
│    ‧₊⏰ 14 🇵🇪 ⌇ 15 🇧🇴 ⌇ 16 🇦🇷      
│
│ㅤㅤʚ 𝙹𝚄𝙶𝙰𝙳𝙾𝚁𝙴𝚂🧸:
│
│➼🧸• 
│➼🧸• 
│➼🧸• 
│➼🧸•
│   ㅤㅤ
│ㅤㅤʚ 𝚂𝚄𝙿𝙻𝙴𝙽𝚃𝙴𝚂🧸:
│➼🧸•
│➼🧸•
│
│  ⊹ ִֶָ𝙳𝙾𝙽𝙰𝙳𝙾𝚁 𝙳𝙴 𝚂𝙰𝙻𝙰🧸: 
│ㅤ
│➼🧸•
╰─────────────────────╯

╭────╼🧸𝙑𝙎 𝙈𝘼𝙎𝘾🧸╾─────╮
│
│         🧸 𝘿𝙮𝙡𝙖𝙣𝘽𝙤𝙩-𝙈𝘿 🧸
│        ₊˚︶︶︶︶︶︶︶︶˚ ‧₊
│
│      ෆ 𝘔𝘰𝘥𝘰: 𝙸𝙽𝙵𝙸𝙽𝙸𝚃𝙾
│      ෆ 𝘏𝘰𝘳𝘢𝘳𝘪𐐫:
│    ‧₊⏰ 16 🇵🇪 ⌇ 17 🇧🇴 ⌇ 18 🇦🇷      
│
│ㅤㅤʚ 𝙹𝚄𝙶𝙰𝙳𝙾𝚁𝙴𝚂🧸:
│
│➼🧸• 
│➼🧸• 
│➼🧸• 
│➼🧸•
│   ㅤㅤ
│ㅤㅤʚ 𝚂𝚄𝙿𝙻𝙴𝙽𝚃𝙴𝚂🧸:
│➼🧸•
│➼🧸•
│
│  ⊹ ִֶָ𝙳𝙾𝙽𝙰𝙳𝙾𝚁 𝙳𝙴 𝚂𝙰𝙻𝙰🧸: 
│ㅤ
│➼🧸•
╰─────────────────────╯

╭────╼🧸𝙑𝙎 𝙈𝘼𝙎𝘾🧸╾─────╮
│
│         🧸 𝘿𝙮𝙡𝙖𝙣𝘽𝙤𝙩-𝙈𝘿 🧸
│        ₊˚︶︶︶︶︶︶︶︶˚ ‧₊
│
│      ෆ 𝘔𝘰𝘥𝘰: 𝙸𝙽𝙵𝙸𝙽𝙸𝚃𝙾
│      ෆ 𝘏𝘰𝘳𝘢𝘳𝘪𐐫:
│    ‧₊⏰ 18 🇵🇪 ⌇ 19 🇧🇴 ⌇ 20 🇦🇷      
│
│ㅤㅤʚ 𝙹𝚄𝙶𝙰𝙳𝙾𝚁𝙴𝚂🧸:
│
│➼🧸• 
│➼🧸• 
│➼🧸• 
│➼🧸•
│   ㅤㅤ
│ㅤㅤʚ 𝚂𝚄𝙿𝙻𝙴𝙽𝚃𝙴𝚂🧸:
│➼🧸•
│➼🧸•
│
│  ⊹ ִֶָ𝙳𝙾𝙽𝙰𝙳𝙾𝚁 𝙳𝙴 𝚂𝙰𝙻𝙰🧸: 
│ㅤ
│➼🧸•
╰─────────────────────╯

╭────╼🧸𝙑𝙎 𝙈𝘼𝙎𝘾🧸╾─────╮
│
│         🧸 𝘿𝙮𝙡𝙖𝙣𝘽𝙤𝙩-𝙈𝘿 🧸
│        ₊˚︶︶︶︶︶︶︶︶˚ ‧₊
│
│      ෆ 𝘔𝘰𝘥𝘰: 𝙸𝙽𝙵𝙸𝙽𝙸𝚃𝙾
│      ෆ 𝘏𝘰𝘳𝘢𝘳𝘪𐐫:
│    ‧₊⏰ 20 🇵🇪 ⌇ 21 🇧🇴 ⌇ 22 🇦🇷      
│
│ㅤㅤʚ 𝙹𝚄𝙶𝙰𝙳𝙾𝚁𝙴𝚂🧸:
│
│➼🧸• 
│➼🧸• 
│➼🧸• 
│➼🧸•
│   ㅤㅤ
│ㅤㅤʚ 𝚂𝚄𝙿𝙻𝙴𝙽𝚃𝙴𝚂🧸:
│➼🧸•
│➼🧸•
│
│  ⊹ ִֶָ𝙳𝙾𝙽𝙰𝙳𝙾𝚁 𝙳𝙴 𝚂𝙰𝙻𝙰🧸: 
│ㅤ
│➼🧸•
╰─────────────────────╯

╭────╼🧸𝙑𝙎 𝙈𝘼𝙎𝘾🧸╾─────╮
│
│         🧸 𝘿𝙮𝙡𝙖𝙣𝘽𝙤𝙩-𝙈𝘿 🧸
│        ₊˚︶︶︶︶︶︶︶︶˚ ‧₊
│
│      ෆ 𝘔𝘰𝘥𝘰: 𝙸𝙽𝙵𝙸𝙽𝙸𝚃𝙾
│      ෆ 𝘏𝘰𝘳𝘢𝘳𝘪𐐫:
│    ‧₊⏰ 22 🇵🇪 ⌇ 23 🇧🇴 ⌇ 00 🇦🇷      
│
│ㅤㅤʚ 𝙹𝚄𝙶𝙰𝙳𝙾𝚁𝙴𝚂🧸:
│
│➼🧸• 
│➼🧸• 
│➼🧸• 
│➼🧸•
│   ㅤㅤ
│ㅤㅤʚ 𝚂𝚄𝙿𝙻𝙴𝙽𝚃𝙴𝚂🧸:
│➼🧸•
│➼🧸•
│
│  ⊹ ִֶָ𝙳𝙾𝙽𝙰𝙳𝙾𝚁 𝙳𝙴 𝚂𝙰𝙻𝙰🧸: 
│ㅤ
│➼🧸•
╰─────────────────────╯
`;