const handler = async (m, {conn}) => {
  m.reply(global.Masc00);
};
handler.command = /^(Mascinfinito00|mascinfinito00)$/i;
export default handler;
handler.admin = true
handler.group = true
handler.botAdmin = true

global.Masc00 = ` 
╭────╼🧸𝙑𝙎 𝙈𝘼𝙎𝘾🧸╾─────╮
│
│         🧸 𝘿𝙮𝙡𝙖𝙣𝘽𝙤𝙩-𝙈𝘿 🧸
│        ₊˚︶︶︶︶︶︶︶︶˚ ‧₊
│
│      ෆ 𝘔𝘰𝘥𝘰: 𝙸𝙽𝙵𝙸𝙽𝙸𝚃𝙾
│      ෆ 𝘏𝘰𝘳𝘢𝘳𝘪𐐫:
│    ‧₊⏰ 00 🇵🇪 ⌇ 01 🇧🇴 ⌇ 02 🇦🇷      
│
│ㅤㅤʚ 𝙹𝚄𝙶𝙰𝙳𝙾𝚁𝙴𝚂🧸:
│
│➼🧸• 
│➼🧸• 
│➼🧸• 
│➼🧸•
│   ㅤㅤ
│ㅤㅤʚ 𝚂𝚄𝙿𝙻𝙴𝙽𝚃𝙴𝚂🧸:
│➼🧸•
│➼🧸•
│
│  ⊹ ִֶָ𝙳𝙾𝙽𝙰𝙳𝙾𝚁 𝙳𝙴 𝚂𝙰𝙻𝙰🧸: 
│ㅤ
│➼🧸•
╰─────────────────────╯
`;